jfdelnero/usbpd_tools/sw/STM32F446_powerdelivery/ST_headers/mini_stm32f4xx_defs.h
#define PIN_0 0
#define PIN_1 1
#define PIN_2 2
#define PIN_3 3
#define PIN_4 4
#define PIN_5 5
#define PIN_6 6
#define PIN_7 7

#define PIN_8 8
#define PIN_9 9
#define PIN_10 10
#define PIN_11 11
#define PIN_12 12
#define PIN_13 13
#define PIN_14 14
#define PIN_15 15


#define PINSHIFT(pin) ( ( pin < 16 ) ? ((uint32_t)(((pin)*2)) ) : ((uint32_t)((( pin - (PIN_15+1) )*2) ))  )
#define PINCFGMASK(pin) ((uint32_t)(0x3 << PINSHIFT(pin) ))

#define PINALTCFGSHIFT(pin) ( ( pin < 8 ) ? ((uint32_t)(((pin)*4)) ) : ((uint32_t)((( pin - PIN_8 )*4) ))  )
#define PINALTCFGMASK(pin) ((uint32_t)(0xF << PINALTCFGSHIFT(pin) ))


#define  SUBPRIORITYBITS(PriorityGroup) ((((PriorityGroup & (uint32_t)0x07UL) + (uint32_t)(__NVIC_PRIO_BITS)) < (uint32_t)7UL) ? (uint32_t)0UL : (uint32_t)(((PriorityGroup & (uint32_t)0x07UL) - 7UL) + (uint32_t)(__NVIC_PRIO_BITS)))
#define  PREEMPTPRIORITYBITS(PriorityGroup) (((7UL - (PriorityGroup & (uint32_t)0x07UL)) > (uint32_t)(__NVIC_PRIO_BITS)) ? (uint32_t)(__NVIC_PRIO_BITS) : (uint32_t)(7UL - (PriorityGroup & (uint32_t)0x07UL)))
#define  PRIORITY_CODE(PriorityGroup,PreemptPriority,SubPriority) ( ((PreemptPriority & (uint32_t)((1UL << PREEMPTPRIORITYBITS(PriorityGroup)) - 1UL)) << SUBPRIORITYBITS(PriorityGroup)) | ((SubPriority     & (uint32_t)((1UL << (SUBPRIORITYBITS(PriorityGroup))) - 1UL))) )

#define SET_IRQ_PRI(IRQ,PRIO) 	CMD_MODIFY_DATA, (uint32_t)&NVIC->IP[((uint32_t)(IRQ>>2))<<2], (0xFF<<(((IRQ)&0x3)*8)) , ( (uint32_t)( ( PRIORITY_CODE(NVIC_PRIORITYGROUP_4,PRIO,0) << (8U - __NVIC_PRIO_BITS) ) & 0xFF ) << ((IRQ&0x3)*8) )
#define SET_SYSIRQ_PRI(IRQ,PRIO) 	CMD_MODIFY_DATA, (uint32_t)&SCB->SHP[(((uint32_t)((((uint32_t)(int32_t)IRQ)&0xFUL)-4UL)>>2))<<2], (0xFF<<(((((((uint32_t)(int32_t)IRQ)&0xFUL)-4UL))&0x3)*8)) , ( (uint32_t)( ( PRIORITY_CODE(NVIC_PRIORITYGROUP_4,PRIO,0) << (8U - __NVIC_PRIO_BITS) ) & 0xFF ) << ((((((uint32_t)(int32_t)IRQ)&0xFUL)-4UL)&0x3)*8) )

#define EN_IRQ(IRQ) (unsigned long)&NVIC->ISER[((uint32_t)IRQ) >> 5UL], (uint32_t)(1UL << (((uint32_t)IRQ) & 0x1FUL))
#define DIS_IRQ(IRQ) (unsigned long)&NVIC->ICER[((uint32_t)IRQ) >> 5UL], (uint32_t)(1UL << (((uint32_t)IRQ) & 0x1FUL))

#define EXEC_EN_IRQ(IRQ) NVIC->ISER[((uint32_t)IRQ) >> 5UL] = (uint32_t)(1UL << (((uint32_t)IRQ) & 0x1FUL));
#define EXEC_DIS_IRQ(IRQ) NVIC->ICER[((uint32_t)IRQ) >> 5UL] = (uint32_t)(1UL << (((uint32_t)IRQ) & 0x1FUL));

#if 0

#define GPIO_MODE             ((uint32_t)0x00000003)
#define EXTI_MODE             ((uint32_t)0x10000000)
#define GPIO_MODE_IT          ((uint32_t)0x00010000)
#define GPIO_MODE_EVT         ((uint32_t)0x00020000)
#define RISING_EDGE           ((uint32_t)0x00100000)
#define FALLING_EDGE          ((uint32_t)0x00200000)
#define GPIO_OUTPUT_TYPE      ((uint32_t)0x00000010)
#define GPIO_NUMBER           ((uint32_t)16)

/* Definitions for bit manipulation of CRL and CRH register */
#define  GPIO_CR_MODE_INPUT         ((uint32_t)0x00000000) /*!< 00: Input mode (reset state)  */
#define  GPIO_CR_CNF_ANALOG         ((uint32_t)0x00000000) /*!< 00: Analog mode  */
#define  GPIO_CR_CNF_INPUT_FLOATING ((uint32_t)0x00000004) /*!< 01: Floating input (reset state)  */
#define  GPIO_CR_CNF_INPUT_PU_PD    ((uint32_t)0x00000008) /*!< 10: Input with pull-up / pull-down  */
#define  GPIO_CR_CNF_GP_OUTPUT_PP   ((uint32_t)0x00000000) /*!< 00: General purpose output push-pull  */
#define  GPIO_CR_CNF_GP_OUTPUT_OD   ((uint32_t)0x00000004) /*!< 01: General purpose output Open-drain  */
#define  GPIO_CR_CNF_AF_OUTPUT_PP   ((uint32_t)0x00000008) /*!< 10: Alternate function output Push-pull  */
#define  GPIO_CR_CNF_AF_OUTPUT_OD   ((uint32_t)0x0000000C) /*!< 11: Alternate function output Open-drain  */

#define PIN_0 0
#define PIN_1 1
#define PIN_2 2
#define PIN_3 3
#define PIN_4 4
#define PIN_5 5
#define PIN_6 6
#define PIN_7 7

#define PIN_8 8
#define PIN_9 9
#define PIN_10 10
#define PIN_11 11
#define PIN_12 12
#define PIN_13 13
#define PIN_14 14
#define PIN_15 15

#define  SUBPRIORITYBITS(PriorityGroup) ((((PriorityGroup & (uint32_t)0x07UL) + (uint32_t)(__NVIC_PRIO_BITS)) < (uint32_t)7UL) ? (uint32_t)0UL : (uint32_t)(((PriorityGroup & (uint32_t)0x07UL) - 7UL) + (uint32_t)(__NVIC_PRIO_BITS)))
#define  PREEMPTPRIORITYBITS(PriorityGroup) (((7UL - (PriorityGroup & (uint32_t)0x07UL)) > (uint32_t)(__NVIC_PRIO_BITS)) ? (uint32_t)(__NVIC_PRIO_BITS) : (uint32_t)(7UL - (PriorityGroup & (uint32_t)0x07UL)))
#define  PRIORITY_CODE(PriorityGroup,PreemptPriority,SubPriority) ( ((PreemptPriority & (uint32_t)((1UL << PREEMPTPRIORITYBITS(PriorityGroup)) - 1UL)) << SUBPRIORITYBITS(PriorityGroup)) | ((SubPriority     & (uint32_t)((1UL << (SUBPRIORITYBITS(PriorityGroup))) - 1UL))) )

#define PINSHIFT(pin) ( ( pin < 16 ) ? ((uint32_t)(((pin)*2)) ) : ((uint32_t)((( pin - PIN_16 )*2) ))  )
#define PINCFGMASK(pin) ((uint32_t)(0x3 << PINSHIFT(pin) ))

#define  GPIO_SPEED_FREQ_LOW              (GPIO_CRL_MODE0_1) /*!< Low speed */
#define  GPIO_SPEED_FREQ_MEDIUM           (GPIO_CRL_MODE0_0) /*!< Medium speed */
#define  GPIO_SPEED_FREQ_HIGH             (GPIO_CRL_MODE0)   /*!< High speed */

/** @defgroup UART_Word_Length UART Word Length
  * @{
  */
#define UART_WORDLENGTH_8B                  0x00000000U
#define UART_WORDLENGTH_9B                  ((uint32_t)USART_CR1_M)
/**
  * @}
  */

/** @defgroup UART_Stop_Bits UART Number of Stop Bits
  * @{
  */
#define UART_STOPBITS_1                     0x00000000U
#define UART_STOPBITS_2                     ((uint32_t)USART_CR2_STOP_1)
/**
  * @}
  */

/** @defgroup UART_Parity UART Parity
  * @{
  */
#define UART_PARITY_NONE                    0x00000000U
#define UART_PARITY_EVEN                    ((uint32_t)USART_CR1_PCE)
#define UART_PARITY_ODD                     ((uint32_t)(USART_CR1_PCE | USART_CR1_PS))
/**
  * @}
  */

/** @defgroup UART_Hardware_Flow_Control UART Hardware Flow Control
  * @{
  */
#define UART_HWCONTROL_NONE                  0x00000000U
#define UART_HWCONTROL_RTS                   ((uint32_t)USART_CR3_RTSE)
#define UART_HWCONTROL_CTS                   ((uint32_t)USART_CR3_CTSE)
#define UART_HWCONTROL_RTS_CTS               ((uint32_t)(USART_CR3_RTSE | USART_CR3_CTSE))
/**
  * @}
  */

/** @defgroup UART_Mode UART Transfer Mode
  * @{
  */
#define UART_MODE_RX                        ((uint32_t)USART_CR1_RE)
#define UART_MODE_TX                        ((uint32_t)USART_CR1_TE)
#define UART_MODE_TX_RX                     ((uint32_t)(USART_CR1_TE | USART_CR1_RE))
/**
  * @}
  */

#define UART_DIV_SAMPLING16(_PCLK_, _BAUD_)            (((_PCLK_)*25U)/(4U*(_BAUD_)))
#define UART_DIVMANT_SAMPLING16(_PCLK_, _BAUD_)        (UART_DIV_SAMPLING16((_PCLK_), (_BAUD_))/100U)
#define UART_DIVFRAQ_SAMPLING16(_PCLK_, _BAUD_)        ((((UART_DIV_SAMPLING16((_PCLK_), (_BAUD_)) - (UART_DIVMANT_SAMPLING16((_PCLK_), (_BAUD_)) * 100U)) * 16U) + 50U) / 100U)
/* UART BRR = mantissa + overflow + fraction
            = (UART DIVMANT << 4) + (UART DIVFRAQ & 0xF0) + (UART DIVFRAQ & 0x0FU) */
#define UART_BRR_SAMPLING16(_PCLK_, _BAUD_)            (((UART_DIVMANT_SAMPLING16((_PCLK_), (_BAUD_)) << 4U) + \
                                                        (UART_DIVFRAQ_SAMPLING16((_PCLK_), (_BAUD_)) & 0xF0U)) + \
                                                        (UART_DIVFRAQ_SAMPLING16((_PCLK_), (_BAUD_)) & 0x0FU))

#endif

